{
  "title": "Kouign-Amann",
  "ingredients": [
    {
      "text": "1 cup ( 240 ml ) water , at room temperature",
      "amount": "1",
      "unit": "cup",
      "name": "( 240 ml ) water , at room temperature"
    },
    {
      "text": "2 teaspoons instant yeast",
      "amount": "2",
      "unit": "teaspoon",
      "name": "instant yeast"
    },
    {
      "text": "2½ cups ( 355 g ) all-purpose flour",
      "amount": null,
      "unit": null,
      "name": "2½ cups ( 355 g ) all-purpose flour"
    },
    {
      "text": "1 teaspoon salt",
      "amount": "1",
      "unit": "teaspoon",
      "name": "salt"
    }
  ],
  "instructions": [
    {
      "text": "Michael Kane — June 20, 2024 @ 5:09 pm Reply I made this recipe for National Kouign-Amann Day, June 20, and they came out great! I’ve made croissants once, had never heard of a Kouign-Amann until I read about them in the National Day Calendar and decided to try it. The hardest part for me was the butter block, the parchment paper I have wasn’t big enough. But I got it worked out. I put chocolate in some of them, and added cinnamon to the sugar. Delicious, flaky, the ones with chocolate are awesome. https://www.facebook.com/share/p/C7CNd1cPKf7dVD3h/"
    },
    {
      "text": "Audrey Hollatz — April 27, 2023 @ 1:15 pm Reply These pastries are BEYOND delicious! I recently fell in love with them at a nearby European style bakery. They also put a little bit of flaked SALT on theirs, and the sweet, flaky pastry with the slightly salty surprises is OUTSTANDING!"
    },
    {
      "text": "Deb — April 27, 2023 @ 8:57 am Reply So excited to see this recipe! They are my favorite pastry (following closely by a morning bun) and hard to find, even in the Washington DC Metro area where I live. Your recipe seems approachable, and I might be brave enough to give it a try. Croissants and their relatives have always seemed to be a bridge too far for this baker, but I think that with your detailed instructions I might be able to do it. Hoping that your son continues to do well. It is always great to read an update about his progress and I’m encouraged for you all about positive results from his treatment."
    },
    {
      "text": "Erin m. — December 28, 2022 @ 11:30 am Reply These turned out amazing! So flakey and beautiful! Time consuming but worth it! One tip – put a baking sheet under the muffin tin because I had some butter spillage. Thanks for the recipe!"
    },
    {
      "text": "Jj — August 12, 2022 @ 11:31 am Reply Hello! I just have a question, I want to make these for tomorrow morning so was going to complete them up to the point of putting them in the pan and letting them rise overnight–just curious if you’ve tried this because I’m wondering if being overnight would change the texture of the sugar/caramelization factor? Thank you! Can’t wait to make these!"
    },
    {
      "text": "Melissa — February 13, 2022 @ 12:07 pm Reply This will be my 4th time using this recipe in last 2-ish years. These are super delicious and worth the time to create. They are pretty D*** close to the ones I had in the Breton region of France, so I’m thrilled. C’est magnifique! Merci beaucoup."
    },
    {
      "text": "Annie — November 24, 2021 @ 3:40 pm Reply I don’t think you should fridge the dough after you sprinkle sugar. I did exactly that and the sugar completely liquified in the fridge."
    },
    {
      "text": "Angela — August 9, 2021 @ 2:15 am Reply So eager to try this, but what to do if I don’t have salted butter on hand? What’s the recommended way to substitute unsalted butter … eg add salt to a particular step??"
    },
    {
      "text": "Leah — May 16, 2021 @ 5:12 pm Reply These were amazing! I have never tried these pastries but the description appealed to me. They are time consuming to make but not hard. The directions are great as well. If you like a croissants with perfect, sweet crispy edges, these are for you. Will 100% be making these again and again."
    },
    {
      "text": "Babs Thompson — January 16, 2021 @ 3:25 pm Reply Just finished baking this today. Prepped over the course of three days, kudos for the make-ahead tips! It was perf, as good as I’d had in Brittany about 20 yrs ago. The chilling between folding and rolling made it foolproof. Will be buying almond paste to tuck into my next attempt. A thousand thanks."
    },
    {
      "text": "Kathy — January 5, 2021 @ 12:40 pm Reply I have never made pastry before but just had to try this. If I can do it anyone can! I put 1/2 teaspoon of cinnamon in with each addition of the sugar. Sooo good. We are them straight out of the oven with the hit butter still dripping out."
    },
    {
      "text": "Marguerite Nowak — December 28, 2020 @ 5:44 pm Reply My Mom and I made this last night (& I am also a Brown Eye Baker ;-) The recipe was easy to follow, results were delicious and the video was helpful. We added in cinnamon into our sugar which was delightful!"
    },
    {
      "text": "Allie — December 28, 2020 @ 3:43 pm Reply I’m so excited to make these! All I have is active dry yeast. Is it okay to use that in this recipe? Is there a conversion or any alternative steps that would need to be followed?"
    },
    {
      "text": "Michael Connor, Washington DC — October 11, 2020 @ 9:49 pm Reply I was so grateful to find your recipe. I first tried another one, for a single large Kouign Amann, and it was a disaster. This recipe was a godsend, because I really wanted individual pastries, and because it’s much better detailed and more logical than the one I tried first. I will say I reduced the amount of sugar, and I used a salted Breton butter, sold at Trader Joe’s under the brand Trader Jacques. In addition, I sprinkled the butter block with about a teaspoon of kosher salt before wrapping it in the yeast dough. The result was actually better than the ones made by my local (very good) French bakery. Although I’ve been baking my whole life (67 years this week), this was my first attempt at any laminated pastry. I’m not sure why I waited so long. I’m starting today on Michelle’s croissant recipe. What’s next? Puff pastry?"
    },
    {
      "text": "Cindy Jarvis — September 15, 2020 @ 12:44 pm Reply This was absolutely amazing! Easy to make and so delicious. I was so impressed with myself. I only used a tablespoon of sugar on roll 3 & 4 and it was plenty sweet. Just shared the recipe with my mom. The funny thing is, we were in Brittany France last year and never tried one of these. Now it is a family staple…."
    },
    {
      "text": "Hannah — September 12, 2020 @ 6:03 pm Reply I am unable to find the video for this recipe and honestly I don’t feel confident making it without some visual guidance. Has it been removed?"
    },
    {
      "text": "Terry — September 2, 2020 @ 12:45 pm Reply To raise the fat content, could you gently melt a larger amount of butter, chill it and THEN measure (or weigh) the solids?"
    },
    {
      "text": "Grace Jeon — August 23, 2020 @ 12:48 am Reply This is the second time making them, and they are absolutely amazing. Thank you!"
    },
    {
      "text": "Kendra Passon — June 24, 2020 @ 1:43 pm Reply OMG! I can not wait to make these! Thank you so much for the video tutorial. I’m so excited to give this a go."
    },
    {
      "text": "Amanda — March 24, 2020 @ 8:08 am Reply First try at anything like this and they came out great! Thanks so much for the thorough recipe, video and pictures. Very clear. And they were super delicious."
    },
    {
      "text": "Hans — March 17, 2020 @ 12:20 pm Reply I am in lockdown due to coronavirus so a 6 hour recipe was the perfect way to pass the time. They were beautiful and delicious. I used 1 cup of sugar instead of 1.5, and sprinkled salt on each of the sugar layers."
    },
    {
      "text": "Pharris — February 16, 2020 @ 11:40 am Reply I would love to make something like this but with almond flavor. Michael Connor, Washington DC — October 11, 2020 @ 10:15 pm Reply This is a great idea! I notice in Michelle’s baking tips section, above, she suggests putting a teaspoon of jam, caramel, or some chocolate chips into the center before folding the pastries. What if you used a teaspoon of frangipane? It’s really easy to make, and leftovers freeze well."
    },
    {
      "text": "Michael Connor, Washington DC — October 11, 2020 @ 10:15 pm Reply This is a great idea! I notice in Michelle’s baking tips section, above, she suggests putting a teaspoon of jam, caramel, or some chocolate chips into the center before folding the pastries. What if you used a teaspoon of frangipane? It’s really easy to make, and leftovers freeze well."
    },
    {
      "text": "Beverly Nelson — January 18, 2020 @ 3:08 pm Reply I applaud your efforts but this is not Kouign Amann. Kouign Amann is known for its sweet, savory taste, which comes from at least 2 tsp of finely ground sea salt being added to 2/3 cup sugar. In fact, in Breton where this pastry hails from it is more savory than sweet. If you omit the salt you are really missing a pastry that is extra special and different from any other pastry you will ever make. Try it!"
    },
    {
      "text": "Cupcakehostess — January 12, 2020 @ 5:45 pm Reply I MADE THESE TODAY!! I put that in caps because a lot of people review a recipe without making it. I followed it to the letter including removing them 5 minutes after baking so it didn’t stick to the pan and putting them in cupcake liners to cool. It’s incredible and easier than it looks-it really is just something that you do over the course of a day but not difficult. The one time it became harder was when the sugar went in as it made the dough sticker than without so just be mindful of that. Enjoy and thank you BEB!!"
    },
    {
      "text": "Tilly — November 19, 2019 @ 4:52 pm Reply Hi Amanda Thank you for this! Any thought on using a food processor for the butter, and if so the best method? I often use food processors instead of mixers for dough with no issue, but not butter on its own. I figure I could cube it and then process until its small pea size, turn it out and then roll it together in the parchment paper? Thanks!"
    },
    {
      "text": "Jamie — September 17, 2019 @ 10:48 am Reply I only put sugar in the last turn because I thought it’d be too sweet. Turned out yummy and perfect and so worth the work!"
    },
    {
      "text": "KC — September 8, 2019 @ 10:03 pm Reply So everything was going well until I put them in the oven. When I just checked halfway through to turn the pan, it looked like the dough and butter had completely separated and they were just blobs. I’m going to keep baking them, but I have little hope. I did everything as the recipe said, step-by-step with the turns and chilling in between. This is my first time dealing with laminating dough, but I want to try again. What did I do wrong? Thanks! James Bigham — May 24, 2020 @ 7:23 pm Reply Hey, I know its been months since you posted this comment but I thought I’d reply just in case no one else has! I’d say you weren’t chilling the dough enough between turns. I make a small amount of laminated dough professionally and we chill the dough at least an hour between turns. if you use a quality butter then it will not get to hard to sheet. It acutely makes the dough easier to sheet because it helps the gluten relax. Hope this helps!"
    },
    {
      "text": "James Bigham — May 24, 2020 @ 7:23 pm Reply Hey, I know its been months since you posted this comment but I thought I’d reply just in case no one else has! I’d say you weren’t chilling the dough enough between turns. I make a small amount of laminated dough professionally and we chill the dough at least an hour between turns. if you use a quality butter then it will not get to hard to sheet. It acutely makes the dough easier to sheet because it helps the gluten relax. Hope this helps!"
    },
    {
      "text": "Mary — April 7, 2019 @ 6:02 pm Reply I made these the other day, and this recipe is really fantastic. I’ve made croissants before, but the methods outlined here made working with laminating dough so much easier to do. Refrigerating the dough between each turn was a great idea and I didn’t have any problems with the dough getting too soft. I just wanted to say much I appreciate the time and effort you put into researching the recipe and making it fool-proof. We only really see the end result, but it’s obvious you went through many iterations to achieve this product. So thank you! I will be making these again, and experimenting with fillings like cinnamon and pistachio."
    },
    {
      "text": "Cortnie — March 31, 2019 @ 2:43 pm Reply This was the first time I have ever made laminated dough. I definitely was certain I messed it up once the sugar was added, but I continued on anyway because I’d already invested so much time. I am so glad I did! These turned out beautiful, flakey, buttery and delicious. I would definitely make these again. Thank you for using this for the March challenge and expanding my horizons!"
    },
    {
      "text": "Luisa — March 18, 2019 @ 1:48 pm Reply Thank you so much for this recipe! I can’t wait to try."
    },
    {
      "text": "Julia — March 10, 2019 @ 5:04 pm Reply The instructions were excellent and the pastries came out fantastic. I’ve had them at high end bakeries and never thought I could get close at home. Thanks for the challenge!"
    },
    {
      "text": "Wendy S — March 8, 2019 @ 3:05 pm Reply Thank you for this one! I am an experienced baker with a small baking business and have not been brave enough to try laminated dough. Happy for this challenge! it has been on my bucket list for years."
    },
    {
      "text": "Katelyn Willis — March 7, 2019 @ 12:31 pm Reply Help!. my butter is coming out. what do I do! Ilene — March 8, 2019 @ 11:48 am Reply I’m making them now, and the same thing is happening to me. I’m rolling it gently, but some butter oozed out. What did you do? Ilene — March 8, 2019 @ 6:17 pm They came out great! Katelyn Willis — March 10, 2019 @ 5:13 pm Assuming same as you, just kept moving forward. With ever subsequent turn in got folded under. Still good but I would love someones input on what I am doing wrong. This happened to me when i made croussanrs. James Bigham — May 24, 2020 @ 7:27 pm Katelyn and Ilene, I know its been ages since you posted these comments but thought I’d put my two cents in. I believe your butter is to soft. you want the butter and the dough to be about the same consistency when you start the lamination. if the dough is stiffer that the butter then the butter oozes out. I always pound my butter between silicone mats with a rolling pin instead of beating it in the mixer. Hope this helps!"
    },
    {
      "text": "Ilene — March 8, 2019 @ 11:48 am Reply I’m making them now, and the same thing is happening to me. I’m rolling it gently, but some butter oozed out. What did you do? Ilene — March 8, 2019 @ 6:17 pm They came out great! Katelyn Willis — March 10, 2019 @ 5:13 pm Assuming same as you, just kept moving forward. With ever subsequent turn in got folded under. Still good but I would love someones input on what I am doing wrong. This happened to me when i made croussanrs. James Bigham — May 24, 2020 @ 7:27 pm Katelyn and Ilene, I know its been ages since you posted these comments but thought I’d put my two cents in. I believe your butter is to soft. you want the butter and the dough to be about the same consistency when you start the lamination. if the dough is stiffer that the butter then the butter oozes out. I always pound my butter between silicone mats with a rolling pin instead of beating it in the mixer. Hope this helps!"
    },
    {
      "text": "Ilene — March 8, 2019 @ 6:17 pm They came out great!"
    },
    {
      "text": "Katelyn Willis — March 10, 2019 @ 5:13 pm Assuming same as you, just kept moving forward. With ever subsequent turn in got folded under. Still good but I would love someones input on what I am doing wrong. This happened to me when i made croussanrs."
    },
    {
      "text": "James Bigham — May 24, 2020 @ 7:27 pm Katelyn and Ilene, I know its been ages since you posted these comments but thought I’d put my two cents in. I believe your butter is to soft. you want the butter and the dough to be about the same consistency when you start the lamination. if the dough is stiffer that the butter then the butter oozes out. I always pound my butter between silicone mats with a rolling pin instead of beating it in the mixer. Hope this helps!"
    },
    {
      "text": "Danceswcooks — March 6, 2019 @ 12:09 pm Reply Your tutorial and video is award winning! Blue Ribbon! Blue Ribbon! I’ll be giving these a go and will post pic. ….now feeling pressured.."
    },
    {
      "text": "Josie F. — March 6, 2019 @ 11:40 am Reply I have never heard of this deliciousness and am unsure how to pronounce it. Can you spell it out phonetically? Thanks so much. Stephani — April 12, 2019 @ 12:20 pm Reply I know this is late, but per the Great British Baking Show addiction that I have – queen amahn. There are probably some nuances to the pronunciation that are missed there, but that’s what it sounds like to me!"
    },
    {
      "text": "Stephani — April 12, 2019 @ 12:20 pm Reply I know this is late, but per the Great British Baking Show addiction that I have – queen amahn. There are probably some nuances to the pronunciation that are missed there, but that’s what it sounds like to me!"
    },
    {
      "text": "Jacob — March 5, 2019 @ 4:32 pm Reply Michelle In the recipe it calls for 8 oz butter which is 2 sticks and uses the mixer but in the recipe notes it says use 2 sticks if doing by hand not a big deal . I don’t think to much butter would hurt I am starting the dough today and make tomorrow"
    },
    {
      "text": "Gale Johnston — March 4, 2019 @ 6:49 pm Reply Oh, wow! Another baked item I have never heard of! (I’d never heard of gougeres.) You are definitely stretching my baking knowledge, which is one of the main reasons I took on this monthly challenge this year. So I offer you a timid thank you, and I hope it will turn into a resounding THANK YOU once I’ve completed this month’s challenge. ;-)"
    },
    {
      "text": "Sandra — March 4, 2019 @ 9:58 am Reply Have you ever watched Great British Bake Off with Mary Berry and Paul Hollywood? They have some great recipes Jacob Johnson — March 5, 2019 @ 2:58 pm Reply I love The Great British Baking Show and ready to make this lamented dough"
    },
    {
      "text": "Jacob Johnson — March 5, 2019 @ 2:58 pm Reply I love The Great British Baking Show and ready to make this lamented dough"
    },
    {
      "text": "Teresa Webber — March 4, 2019 @ 6:59 am Reply I’m sorry but I’m going to have to cheat on this one. I’ll be calling William & Sonoma to place my order. 😉 Sally K — March 5, 2019 @ 8:05 am Reply I’ll get mine from a local bakery. There are probably extremely few, if any, French women who would attempt to make this at home. “What I learned living in Paris, traveling through France, and writing Baking Chez Moi, is that French people don’t bake … at least they don’t bake anything fussy, finicky, tricky, or unreliable. When they bake, they bake the simple stuff.” Dorie Greenspan Amanda — March 7, 2019 @ 3:07 pm I never heard that quote from Dorrie, but that is a great one! Thanks for sharing, Sally :) and I’m impressed that you could recall it! Point me to whatever high-quality bakery you go to. They must have some way-too-tempting treats. Sally K — March 7, 2019 @ 6:55 pm I have a knack for remembering things I don’t need to know! The bakery is Circle City Sweets in the City Market in Indianapolis. They used to have a booth at the farmer’s market I went to and that’s where I first had kouign-amann. For various reasons I rarely get to the bakery."
    },
    {
      "text": "Sally K — March 5, 2019 @ 8:05 am Reply I’ll get mine from a local bakery. There are probably extremely few, if any, French women who would attempt to make this at home. “What I learned living in Paris, traveling through France, and writing Baking Chez Moi, is that French people don’t bake … at least they don’t bake anything fussy, finicky, tricky, or unreliable. When they bake, they bake the simple stuff.” Dorie Greenspan Amanda — March 7, 2019 @ 3:07 pm I never heard that quote from Dorrie, but that is a great one! Thanks for sharing, Sally :) and I’m impressed that you could recall it! Point me to whatever high-quality bakery you go to. They must have some way-too-tempting treats. Sally K — March 7, 2019 @ 6:55 pm I have a knack for remembering things I don’t need to know! The bakery is Circle City Sweets in the City Market in Indianapolis. They used to have a booth at the farmer’s market I went to and that’s where I first had kouign-amann. For various reasons I rarely get to the bakery."
    },
    {
      "text": "Amanda — March 7, 2019 @ 3:07 pm I never heard that quote from Dorrie, but that is a great one! Thanks for sharing, Sally :) and I’m impressed that you could recall it! Point me to whatever high-quality bakery you go to. They must have some way-too-tempting treats."
    },
    {
      "text": "Sally K — March 7, 2019 @ 6:55 pm I have a knack for remembering things I don’t need to know! The bakery is Circle City Sweets in the City Market in Indianapolis. They used to have a booth at the farmer’s market I went to and that’s where I first had kouign-amann. For various reasons I rarely get to the bakery."
    },
    {
      "text": "Nicole Shugars — March 4, 2019 @ 6:56 am Reply Oh my gosh!!!! I just put this on my “baking bucket list” for this year!!! I can’t wait to try it. Thank you, Michelle!"
    },
    {
      "text": "Amanda — March 4, 2019 @ 4:34 am Reply Michelle, I could never do this, but please note that I am too scared to even stir and bake up a banana bread. You are so incredibly talented and I clicked back to your Cucidati Cookies from 10 years ago, and I am in awe of your depth of knowledge, your skill, the traditions you stick to, the instructions your provide to your readers, and your serious CIA-level creations. To all of your faithful followers who attempt (and succeed) at these kouign-amanns, “Bravo.” I can only dream and admire their ability to be undaunted. Yes, you definitely have earned the reputation as the “go-to” baker from many of your fans."
    }
  ],
  "source_url": "https://www.browneyedbaker.com/kouign-amann/",
  "quality_metrics": {
    "overall_quality": 0.5593807692307693,
    "completeness_score": 0.9,
    "instruction_clarity": 0.2619230769230768,
    "ingredient_validity": 0.5945,
    "timing_validity": 0.5,
    "temperature_validity": 0.5,
    "portion_consistency": 0.5,
    "needs_improvement": true
  }
}
