{
  "title": "Legendary XO Sauce",
  "status": "excellent",
  "yields": "2 cups (about 16 servings)",
  "description": "This isn't just XO sauce - it's liquid gold, a complex umami bomb that transforms any dish it touches. Created in Hong Kong in the 1980s, XO sauce represents the pinnacle of Cantonese culinary luxury. This enhanced version features precise temperature control, careful ingredient staging, and extended infusion periods. The result is a perfectly balanced condiment with layers of flavor that unfold on the palate.",
  "ingredients": {
    "dried seafood": [
      {
        "text": "4 ounces dried scallops (conpoy)",
        "amount": "4",
        "unit": "ounce",
        "name": "dried scallops",
        "notes": "Premium grade from Hokkaido, golden in color"
      },
      {
        "text": "4 ounces dried shrimp",
        "amount": "4",
        "unit": "ounce",
        "name": "dried shrimp",
        "notes": "Medium-sized, bright orange color"
      }
    ],
    "proteins": [
      {
        "text": "6 ounces Jinhua ham or prosciutto",
        "amount": "6",
        "unit": "ounce",
        "name": "Jinhua ham",
        "notes": "Finely minced, can substitute premium prosciutto"
      }
    ],
    "aromatics": [
      {
        "text": "12 cloves garlic",
        "amount": "12",
        "unit": null,
        "name": "garlic",
        "notes": "Fresh, finely minced"
      },
      {
        "text": "4 large shallots",
        "amount": "4",
        "unit": null,
        "name": "shallots",
        "notes": "Finely minced"
      },
      {
        "text": "2 inches fresh ginger",
        "amount": "2",
        "unit": "inch",
        "name": "fresh ginger",
        "notes": "Finely minced"
      }
    ],
    "chiles": [
      {
        "text": "8 fresh red Thai bird chiles",
        "amount": "8",
        "unit": null,
        "name": "Thai bird chiles",
        "notes": "Stems removed, finely minced"
      },
      {
        "text": "2 ounces dried Chinese red chiles",
        "amount": "2",
        "unit": "ounce",
        "name": "dried Chinese red chiles",
        "notes": "Stems and seeds removed, ground to flakes"
      }
    ],
    "oils and seasonings": [
      {
        "text": "2 cups neutral oil",
        "amount": "2",
        "unit": "cup",
        "name": "neutral oil",
        "notes": "Grapeseed or peanut oil"
      },
      {
        "text": "2 tablespoons oyster sauce",
        "amount": "2",
        "unit": "tablespoon",
        "name": "oyster sauce",
        "notes": "Premium Lee Kum Kee preferred"
      },
      {
        "text": "1 tablespoon light soy sauce",
        "amount": "1",
        "unit": "tablespoon",
        "name": "light soy sauce",
        "notes": "Pearl River Bridge recommended"
      },
      {
        "text": "1 tablespoon dark soy sauce",
        "amount": "1",
        "unit": "tablespoon",
        "name": "dark soy sauce",
        "notes": "For color and depth"
      },
      {
        "text": "2 tablespoons brown sugar",
        "amount": "2",
        "unit": "tablespoon",
        "name": "brown sugar",
        "notes": "Dark brown sugar preferred"
      }
    ]
  },
  "instructions": [
    {
      "text": "PREPARE DRIED SEAFOOD (8-12 HOURS AHEAD): Place dried scallops in a bowl and cover with hot water. In a separate bowl, do the same with dried shrimp. Cover both and refrigerate for 8-12 hours or overnight."
    },
    {
      "text": "PROCESS SEAFOOD: Drain scallops and shrimp, reserving 1/4 cup of each soaking liquid. Shred scallops by hand into fine strands. Finely chop the shrimp by hand or pulse briefly in food processor."
    },
    {
      "text": "PREPARE HAM: If using Jinhua ham or prosciutto, remove any tough exterior parts and finely mince by hand. The pieces should be no larger than a grain of rice."
    },
    {
      "text": "PREPARE AROMATICS: Combine minced garlic, shallots, and ginger in a bowl. Keep separate from other ingredients."
    },
    {
      "text": "STAGE ONE - SEAFOOD: Heat 1/2 cup oil in a large wok over medium-low heat. Add shredded scallops and chopped shrimp. Cook, stirring frequently, until seafood is very dry and starting to brown, about 15-20 minutes. Transfer to a bowl."
    },
    {
      "text": "STAGE TWO - HAM: In the same wok, add another 1/2 cup oil and the minced ham. Cook over medium-low heat until ham is crispy and fat has rendered, about 10-15 minutes. Transfer to bowl with seafood."
    },
    {
      "text": "STAGE THREE - AROMATICS: Add remaining oil to wok. When oil reaches 225°F (use thermometer), add garlic, shallots, and ginger. Cook, stirring constantly, until aromatics are golden brown and very fragrant, about 10-15 minutes. Watch temperature carefully."
    },
    {
      "text": "ADD CHILES: Add both fresh and dried chiles to the aromatics. Continue cooking for 5 minutes until chiles are fragrant and slightly darkened."
    },
    {
      "text": "COMBINE AND SEASON: Return seafood and ham mixture to wok. Add both soy sauces, oyster sauce, brown sugar, and 2 tablespoons each of reserved scallop and shrimp soaking liquid. Cook, stirring frequently, until liquid is reduced and mixture is jammy, about 10 minutes."
    },
    {
      "text": "FINAL COOKING: Reduce heat to lowest setting. Continue cooking, stirring occasionally, until oil separates and floats to top, and solids are deep reddish-brown, about 15-20 minutes more."
    },
    {
      "text": "COOL AND AGE: Let cool completely in the wok. Transfer to sterilized jars, making sure solids are covered with oil. Age in refrigerator for at least 3 days before using."
    }
  ],
  "notes": [
    "INGREDIENT SELECTION: The quality of dried seafood is crucial. Look for large, intact scallops with a sweet aroma and bright orange shrimp without any off smells.",
    "TEMPERATURE CONTROL: Keep heat moderate throughout cooking. Too high heat will burn the ingredients, while too low won't develop proper flavor.",
    "TEXTURE GUIDE: The final texture should be jammy and loose enough to spoon, but not liquid. The oil should separate and float to the top when settled.",
    "AGING: While usable immediately, XO sauce develops deeper flavor over time. Peak flavor is reached after about 2 weeks of aging in the refrigerator.",
    "STORAGE: Properly made and stored (always covered with oil), XO sauce will keep for 6 months in the refrigerator.",
    "USES: Traditional uses include stir-fries, noodles, and congee, but also excellent with pasta, eggs, or grilled meats.",
    "VARIATIONS: Some high-end versions include dried abalone or fish maw. These can be prepared similarly to the scallops if desired."
  ],
  "source_url": "https://www.seriouseats.com/2019/04/how-to-make-xo-sauce-the-cooks-condiment.html",
  "quality_metrics": {
    "overall_quality": 0.98,
    "completeness_score": 1.0,
    "instruction_clarity": 0.95,
    "ingredient_validity": 1.0,
    "timing_validity": 1.0,
    "temperature_validity": 1.0,
    "portion_consistency": 1.0,
    "needs_improvement": false
  }
}
